Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.2.52/PIC32CM6408MC00032/include/component/nvmctrl.h
#define NVMCTRL_INTENSET_READY_Pos            _U_(0)                                               /**< (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Position */
#define NVMCTRL_INTENSET_READY_Msk            (_U_(0x1) << NVMCTRL_INTENSET_READY_Pos)             /**< (NVMCTRL_INTENSET) NVM Ready Interrupt Enable Mask */
#define NVMCTRL_INTENSET_READY(value)         (NVMCTRL_INTENSET_READY_Msk & ((value) << NVMCTRL_INTENSET_READY_Pos))
#define NVMCTRL_INTENSET_ERROR_Pos            _U_(1)                                               /**< (NVMCTRL_INTENSET) Error Interrupt Enable Position */
#define NVMCTRL_INTENSET_ERROR_Msk            (_U_(0x1) << NVMCTRL_INTENSET_ERROR_Pos)             /**< (NVMCTRL_INTENSET) Error Interrupt Enable Mask */
#define NVMCTRL_INTENSET_ERROR(value)         (NVMCTRL_INTENSET_ERROR_Msk & ((value) << NVMCTRL_INTENSET_ERROR_Pos))
#define NVMCTRL_INTENSET_Msk                  _U_(0x00000003)                                      /**< (NVMCTRL_INTENSET) Register Mask  */


/* -------- NVMCTRL_INTFLAG : (NVMCTRL Offset: 0x14) (R/W 32) Interrupt Flag Status and Clear -------- */
#define NVMCTRL_INTFLAG_RESETVALUE            _U_(0x00)                                            /**<  (NVMCTRL_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define NVMCTRL_INTFLAG_READY_Pos             _U_(0)                                               /**< (NVMCTRL_INTFLAG) NVM Ready Position */
#define NVMCTRL_INTFLAG_READY_Msk             (_U_(0x1) << NVMCTRL_INTFLAG_READY_Pos)              /**< (NVMCTRL_INTFLAG) NVM Ready Mask */
#define NVMCTRL_INTFLAG_READY(value)          (NVMCTRL_INTFLAG_READY_Msk & ((value) << NVMCTRL_INTFLAG_READY_Pos))
#define   NVMCTRL_INTFLAG_READY_Val_0_Val     _U_(0x0)                                             /**< (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing.  */
#define   NVMCTRL_INTFLAG_READY_Val_1_Val     _U_(0x1)                                             /**< (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command  */
#define NVMCTRL_INTFLAG_READY_Val_0           (NVMCTRL_INTFLAG_READY_Val_0_Val << NVMCTRL_INTFLAG_READY_Pos) /**< (NVMCTRL_INTFLAG) The NVM controller is busy programming or erasing. Position  */
#define NVMCTRL_INTFLAG_READY_Val_1           (NVMCTRL_INTFLAG_READY_Val_1_Val << NVMCTRL_INTFLAG_READY_Pos) /**< (NVMCTRL_INTFLAG) The NVM controller is ready to accept a new command Position  */
#define NVMCTRL_INTFLAG_ERROR_Pos             _U_(1)                                               /**< (NVMCTRL_INTFLAG) Error Position */
#define NVMCTRL_INTFLAG_ERROR_Msk             (_U_(0x1) << NVMCTRL_INTFLAG_ERROR_Pos)              /**< (NVMCTRL_INTFLAG) Error Mask */
#define NVMCTRL_INTFLAG_ERROR(value)          (NVMCTRL_INTFLAG_ERROR_Msk & ((value) << NVMCTRL_INTFLAG_ERROR_Pos))
#define   NVMCTRL_INTFLAG_ERROR_Val_0_Val     _U_(0x0)                                             /**< (NVMCTRL_INTFLAG) No errors have been received since the last clear  */
#define   NVMCTRL_INTFLAG_ERROR_Val_1_Val     _U_(0x1)                                             /**< (NVMCTRL_INTFLAG) At least one error has occurred since the last clear  */
#define NVMCTRL_INTFLAG_ERROR_Val_0           (NVMCTRL_INTFLAG_ERROR_Val_0_Val << NVMCTRL_INTFLAG_ERROR_Pos) /**< (NVMCTRL_INTFLAG) No errors have been received since the last clear Position  */
#define NVMCTRL_INTFLAG_ERROR_Val_1           (NVMCTRL_INTFLAG_ERROR_Val_1_Val << NVMCTRL_INTFLAG_ERROR_Pos) /**< (NVMCTRL_INTFLAG) At least one error has occurred since the last clear Position  */
#define NVMCTRL_INTFLAG_Msk                   _U_(0x00000003)                                      /**< (NVMCTRL_INTFLAG) Register Mask  */


/* -------- NVMCTRL_STATUS : (NVMCTRL Offset: 0x18) (R/W 16) Status -------- */
#define NVMCTRL_STATUS_RESETVALUE             _U_(0x00)                                            /**<  (NVMCTRL_STATUS) Status  Reset Value */

#define NVMCTRL_STATUS_PRM_Pos                _U_(0)                                               /**< (NVMCTRL_STATUS) Power Reduction Mode Position */
#define NVMCTRL_STATUS_PRM_Msk                (_U_(0x1) << NVMCTRL_STATUS_PRM_Pos)                 /**< (NVMCTRL_STATUS) Power Reduction Mode Mask */
#define NVMCTRL_STATUS_PRM(value)             (NVMCTRL_STATUS_PRM_Msk & ((value) << NVMCTRL_STATUS_PRM_Pos))
#define NVMCTRL_STATUS_LOAD_Pos               _U_(1)                                               /**< (NVMCTRL_STATUS) NVM Page Buffer Active Loading Position */
#define NVMCTRL_STATUS_LOAD_Msk               (_U_(0x1) << NVMCTRL_STATUS_LOAD_Pos)                /**< (NVMCTRL_STATUS) NVM Page Buffer Active Loading Mask */
#define NVMCTRL_STATUS_LOAD(value)            (NVMCTRL_STATUS_LOAD_Msk & ((value) << NVMCTRL_STATUS_LOAD_Pos))
#define NVMCTRL_STATUS_PROGE_Pos              _U_(2)                                               /**< (NVMCTRL_STATUS) Programming Error Status Position */
#define NVMCTRL_STATUS_PROGE_Msk              (_U_(0x1) << NVMCTRL_STATUS_PROGE_Pos)               /**< (NVMCTRL_STATUS) Programming Error Status Mask */
#define NVMCTRL_STATUS_PROGE(value)           (NVMCTRL_STATUS_PROGE_Msk & ((value) << NVMCTRL_STATUS_PROGE_Pos))
#define NVMCTRL_STATUS_LOCKE_Pos              _U_(3)                                               /**< (NVMCTRL_STATUS) Lock Error Status Position */
#define NVMCTRL_STATUS_LOCKE_Msk              (_U_(0x1) << NVMCTRL_STATUS_LOCKE_Pos)               /**< (NVMCTRL_STATUS) Lock Error Status Mask */
#define NVMCTRL_STATUS_LOCKE(value)           (NVMCTRL_STATUS_LOCKE_Msk & ((value) << NVMCTRL_STATUS_LOCKE_Pos))
#define NVMCTRL_STATUS_NVME_Pos               _U_(4)                                               /**< (NVMCTRL_STATUS) NVM Error Position */
#define NVMCTRL_STATUS_NVME_Msk               (_U_(0x1) << NVMCTRL_STATUS_NVME_Pos)                /**< (NVMCTRL_STATUS) NVM Error Mask */
#define NVMCTRL_STATUS_NVME(value)            (NVMCTRL_STATUS_NVME_Msk & ((value) << NVMCTRL_STATUS_NVME_Pos))
#define NVMCTRL_STATUS_SB_Pos                 _U_(8)                                               /**< (NVMCTRL_STATUS) Security Bit Status Position */
#define NVMCTRL_STATUS_SB_Msk                 (_U_(0x1) << NVMCTRL_STATUS_SB_Pos)                  /**< (NVMCTRL_STATUS) Security Bit Status Mask */
#define NVMCTRL_STATUS_SB(value)              (NVMCTRL_STATUS_SB_Msk & ((value) << NVMCTRL_STATUS_SB_Pos))
#define NVMCTRL_STATUS_Msk                    _U_(0x011F)                                          /**< (NVMCTRL_STATUS) Register Mask  */


